Repository: MontaServices/woocommerce-monta-checkout
Catalog: languages/montapacking-checkout-*.po
Languages: nl_nl

source: Settings
nl_nl: Instellingen

source: Select a shipping method.
nl_nl: Selecteer een verzendmethode.

source: Select a pickup location.
nl_nl: Selecteer een ophaalpunt.

source: The shipment option(s) you choose are not available at this time, please select an other option.
nl_nl: De verzendoptie(s) die je probeert te kiezen zijn op dit moment niet toegankelijk, selecteer een andere optie.

source: Shipping
nl_nl: Verzenden

source: Choose a shipping method
nl_nl: Selecteer een verzendmethode

source: Shipping method
nl_nl: Verzendmethode

source: Please fill in an address before selecting a shipping method
nl_nl: Vul eerst een adres in voordat je een verzendmethode kiest

source: Delivery
nl_nl: Bezorgopties

source: Pickup
nl_nl: Ophaalpunt

source: Loading...
nl_nl: Laden...

source: Select delivery time and date
nl_nl: Selecteer afleverdatum en tijd

source: Select a shipping option
nl_nl: Selecteer een verzendoptie

source: Your order will be delivered with
nl_nl: Je order wordt bezorgd met

source: Your order will be
nl_nl: Je order wordt

source: delivered
nl_nl: bezorgd

source: shipped
nl_nl: verstuurd

source: with
nl_nl: met

source: on
nl_nl: op

source: between
nl_nl: tussen

source: Click here to choose another delivery option
nl_nl: Klik hier om een andere bezorgoptie te kiezen

source: Delivery time and date
nl_nl: Afleverdatum en tijd

source: Send date
nl_nl: Verzenddatum

source: Earlier
nl_nl: Eerder

source: Show more options
nl_nl: Bekijk meer opties

source: Selected pickup point
nl_nl: Geselecteerd ophaalpunt

source: Extra options:
nl_nl: Extra opties:

source: Search using postal code
nl_nl: Zoeken op postcode

source: Search
nl_nl: Zoeken

source: Use selection
nl_nl: Gebruik selectie

source: Free of charge
nl_nl: Gratis

source: Free
nl_nl: Gratis

source: evening delivery
nl_nl: avondlevering

source: No deliveries available for the chosen delivery address
nl_nl: Geen bezorgopties beschikbaar voor het gekozen adres

source: No pickups available for the chosen delivery address
nl_nl: Geen ophaalpunten beschikbaar voor het gekozen adres

source: ships on
nl_nl: verzending op

source: from the Netherlands
nl_nl: vanuit Nederland

source: Please enter a postal number, this is mandatory for this pick-up option
nl_nl: Vul alstublieft een postnummer in, dit is verplicht voor deze afhaaloptie

source: Store Collect
nl_nl: Winkel afhalen

source: Sustainably delivered
nl_nl: Duurzaam bezorgd

source: Standard delivery
nl_nl: Standaard levering
